html/erlang/tutorial/sequential/module_function.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>模块和函数</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="shell.html"> UP </a>
 |
 <a accesskey="H" href="sequential.html"> HOME </a>
</div><div id="content">
<h1 class="title">模块和函数</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org54c8e9f">阶乘函数</a></li>
<li><a href="#org659bcbb">多个参数</a></li>
</ul>
</div>
</div>
<pre class="example">
如果一种编程语言只能通过 shell 来运行代码，那么这种语言基本上没什么太大的用处，Erlang 同样可以通过脚本来运行程序
</pre>

<p>
这里有一小段 Erlang 程序。使用合适的文本编辑器将其输入到文件 <span class="underline">tut.erl</span> 中。文件名称必须为 tut.erl 不能任意修改，并且需要将其放置于启动 erl 命令时所在的目录下
</p>

<pre class="example">
如果恰巧编辑器有 Erlang 模式的话，那么编辑器会帮助你优雅地组织和格式化你的代码 （参考 Emacs 的 Erlang 模式）

不过即使没有这样的编辑器，也可以很好地管理自己的代码
</pre>
<p>
下面是待输入的代码：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ffd700;">-module</span>(tut).
<span style="color: #ffd700;">-export</span>([<span style="color: #98f5ff;">double/1</span>]).

<span style="color: #daa520; font-weight: bold;">double</span>(<span style="color: #4eee94;">X</span>) -&gt;
    2 * <span style="color: #4eee94;">X</span>.
</pre>
</div>

<p>
很容易就可以看出来这个程序将数值翻倍。开始两行的代码稍后会解释。先来编译一下这段代码。可以在 Erlang shell 下来完成这个任务，其中 <span class="underline">c</span> 代表 <b>编译</b> 的意思：
</p>

<div class="org-src-container">
<pre class="src src-sh">3&gt; c(tut)<span style="color: #f08080;">.</span>
{ok,tut}
</pre>
</div>
<p>
{ok,tut} 说明编译成功。如果返回 <span class="underline">error</span> 则表示输入的代码中存在错误
</p>

<pre class="example">
其它相关的错误信息可以帮助你弄清楚错误的位置和原因，然后可以根据错误提示修改并重新编译代码
</pre>


<p>
下面运行这个程序：
</p>

<div class="org-src-container">
<pre class="src src-sh">4&gt; tut:double(10)<span style="color: #f08080;">.</span>
20
</pre>
</div>


<pre class="example">
和预期结果一样，10 乘以 2 后就是 20
</pre>

<p>
先回到代码最开始的这两行。每个的 Erlang 程序的文件都包含一个 <span class="underline">Erlang 模块</span> 。模块中代码的 <span class="underline">第一行</span> 就是该 <span class="underline">模块的名字</span> ：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ffd700;">-module</span>(tut).
</pre>
</div>

<pre class="example">
因此，这个模块名为 tut 请注意该行代码结束后的句号 '.'  
</pre>

<p>
存储模块的 <b>文件必须与模块同名</b> ，并且以 <span class="underline">.erl</span> 作为扩展
</p>

<pre class="example">
在这个例子中，文件名为 tut.erl
</pre>

<p>
如果使用到另外一个模块中的一个函数，可以使用如下的语法 <span class="underline">module<sub>name</sub>:function<sub>name</sub>(arguments)</span> 因此，下面的代码的含义也就是调用模块 tut 中的函数 double，并且传递的实参为 10：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #98f5ff;">tut</span>:<span style="color: #98f5ff;">double</span>(10).
</pre>
</div>

<p>
第二行声明 tut 模块中包含一个 <span class="underline">double 函数</span> ，此函数接受 <span class="underline">一个参数</span> （在本例中为 X）:
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ffd700;">-export</span>([<span style="color: #98f5ff;">double/1</span>]).
</pre>
</div>

<pre class="example">
同时，第二行声明也说明了这个函数可以在 tut 模块外被其它模块调用

后面会详细说明这一点，请再次注意这一行末尾的句号
</pre>


<div id="outline-container-org54c8e9f" class="outline-2">
<h2 id="org54c8e9f">阶乘函数</h2>
<div class="outline-text-2" id="text-org54c8e9f">
<pre class="example">
接下来给出一个更加复杂的例子，计算一个数的阶乘

比如，4 的阶乘即为 432*1，等于 24
</pre>
<p>
在 tut1.erl 文件中输入如下的一段代码：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ffd700;">-module</span>(tut1).
<span style="color: #ffd700;">-export</span>([<span style="color: #98f5ff;">fac/1</span>]).

<span style="color: #daa520; font-weight: bold;">fac</span>(1) -&gt;
    1;
<span style="color: #daa520; font-weight: bold;">fac</span>(<span style="color: #4eee94;">N</span>) -&gt;
    <span style="color: #4eee94;">N</span> * <span style="color: #98f5ff;">fac</span>(<span style="color: #4eee94;">N</span> - 1).
</pre>
</div>

<pre class="example">
所以在模块 tut1 中存在一个函数 fac，此函数接受一个输入参数 N
</pre>

<p>
第一部分说明的是 1 的阶乘即为 1：
</p>
<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #daa520; font-weight: bold;">fac</span>(1) -&gt;
    1;
</pre>
</div>
<p>
需要注意的是，这一部分是以 <span class="underline">分号</span> 结束的，这也就表示后面还有 fac 函数的更多内容。第二部分表示 N 的阶乘为 N 乘以 N-1 的阶乘：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #daa520; font-weight: bold;">fac</span>(<span style="color: #4eee94;">N</span>) -&gt;
    <span style="color: #4eee94;">N</span> * <span style="color: #98f5ff;">fac</span>(<span style="color: #4eee94;">N</span> - 1).
</pre>
</div>

<p>
与前面不同，这部分是以 <span class="underline">句号</span> 结尾的。这也就是说，后面没有这个函数更多的内容了
</p>

<div class="org-src-container">
<pre class="src src-sh">6&gt; tut1:fac(4)<span style="color: #f08080;">.</span>
24
</pre>
</div>

<pre class="example">
调用 tut1 模块中的 fac 函数，传入的参数为 4
</pre>
</div>
</div>

<div id="outline-container-org659bcbb" class="outline-2">
<h2 id="org659bcbb">多个参数</h2>
<div class="outline-text-2" id="text-org659bcbb">
<pre class="example">
与其它语言一样，Erlang 函数也可以有多个参数
</pre>
<p>
扩展 tut1 模块，实现一个函数完成两个数相乘：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ffd700;">-module</span>(tut1).
<span style="color: #ffd700;">-export</span>([<span style="color: #98f5ff;">fac/1</span>, <span style="color: #98f5ff;">mult/2</span>]).

<span style="color: #daa520; font-weight: bold;">fac</span>(1) -&gt;
    1;
<span style="color: #daa520; font-weight: bold;">fac</span>(<span style="color: #4eee94;">N</span>) -&gt;
    <span style="color: #4eee94;">N</span> * <span style="color: #98f5ff;">fac</span>(<span style="color: #4eee94;">N</span> - 1).

<span style="color: #daa520; font-weight: bold;">mult</span>(<span style="color: #4eee94;">X</span>, <span style="color: #4eee94;">Y</span>) -&gt;
    <span style="color: #4eee94;">X</span> * <span style="color: #4eee94;">Y</span>.
</pre>
</div>

<p>
扩展模块时，需要修改 -export 这一行。在这一行中添加另外一个接受两个参数的函数 mult
</p>

<div class="org-src-container">
<pre class="src src-sh">8&gt; tut1:mult(3,4)<span style="color: #f08080;">.</span>
12
</pre>
</div>

<p>
在这个例子中，数字是整数值，代码中函数的参数 N、X 与 Y 被称之为 <span class="underline">变量</span> 。变量必须以 <b>大写字母</b> 开始 
</p>

<pre class="example">
诸如，Number、ShoeSize 和 Age 都是变量
</pre>

<p>
<a href="atom.html">Next：原子类型</a>
</p>

<p>
<a href="shell.html">Previous：Erlang Shell</a>
</p>

<p>
<a href="sequential.html">Home：顺序编程</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
